testing/Serverless-Artillery/serverless-artillery-test-users-id-api.yml
#Artillery test for /users/{user_id}/tasks- 10 concurrent requests per second for 5 mins

config:
  target: "https://nsc-func-dev-usw2-tuesday.azurewebsites.net"
  phases:
    - duration: 300
      arrivalRate: 10
      name: "users"
scenarios:
  - flow:
      - get:
          url: "/users/1/"
          json:
            name: "name"

#config:
#  target: "https://nsc-func-dev-usw2-tuesday.azurewebsites.net"
#  phases:
#    - duration: 300
#      arrivalRate: 10
#      name: "users"
#scenarios:
#  - flow:
#      - get:
#          url: "/users/{userId}/tasks"
#          json:
#            name: "name"



# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
#config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
#  target: "http://aws.amazon.com"
#  phases:
#    -
#      duration: 5
#      arrivalRate: 2
#scenarios:
#  -
#    flow:
#      -
#        get:
#          url: "/"