testing/Serverless-Artillery/test-users-userid-tasks.yml
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://nsc-func-dev-usw2-tuesday.azurewebsites.net/api/users/1/tasks/1"
  phases:
    -
      duration: 3600
      arrivalRate: 10
scenarios:
  - name: "Load Test"
    flow:
      - get:
        url: "/api/HttpTriggerLoadTest/"
        afterResponse: "logResponse"